#. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
#   *Примеры:*
#    - 5, 25 -> да
#   - 4, 16 -> да
#   - 25, 5 -> да
#   - 8,9 -> нет

# num1 = int(input('Введите число 1: '))
# num2 = int(input('Введите число 2: '))
#
# if num1 == num2*2:
#     print(f'{num1} является квадратом {num2}')
#
# elif num2 == num1**2:
#     print(f'{num2} является квадратом {num1}')
#
# else:
#     print('Нет, числа не  являются квадратами друг  друга')

# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.
# Примеры:
# - 1, 4, 8, 7, 5 -> 8
# - 78, 55, 36, 90, 2 -> 90

# num1 = int(input('Введите число 1: '))
# num2 = int(input('Введите число 2: '))
# num3 = int(input('Введите число 3: '))
# num4 = int(input('Введите число 4: '))
# num5 = int(input('Введите число 5: '))
#
# temp = 0
#
# if num1 < num2:
#     temp = num2
#
# elif num2 < num3:
#     temp = num3
# elif num3 < num4 or num5 < num4:
#     print(num4)
# elif num4 < num5 or num5 < num1:
#     print(num5)


# my_list = []
# for i in range(5):
#     number = int(input(f'Введите {i+1} число: '))
#     my_list.append(number)
# my_max = my_list[0]

# for i in range(1, len(my_list)):
#     if my_max < my_list:
#         my_max = my_list[i]
# print (f'Максимальное значение списка: {my_max}')


# for item in my_list:
#     print(my_list)

# for i in range(len(my_list)):
#     print(my_list[i])




